Revit 2027 API
ParameterTypeId.RebarBarMassPerUnitLength Property
 "Bar Mass per Unit Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarBarMassPerUnitLength { get; }
Public Shared ReadOnly Property RebarBarMassPerUnitLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarBarMassPerUnitLength {
	ForgeTypeId^ get ();
}
static member RebarBarMassPerUnitLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace